Repository: riandeoliveira/PortfolioAPI
Catalog: src/Portfolio.Utils/Resources/LocalizationResource.*.resx
Languages: pt_br

# EmailAlreadyExists
source: This 'email' is already being used.
pt_br: Este 'e-mail' já está sendo usado.

# EmailIsNotRegistered
source: This 'email' is not registered.
pt_br: Este 'e-mail' não está registrado.

# EmailIsRequired
source: The 'email' must be provided.
pt_br: O 'e-mail' deve ser informado.

# InvalidEmail
source: The 'email' must be valid.
pt_br: O 'e-mail' deve ser válido.

# MaximumEmailLength
source: The 'email' must have a maximum of 64 characters.
pt_br: O 'e-mail' deve possuir no máximo 64 carateres.

# MinimumEmailLength
source: The 'email' must have a minimum of 8 characters.
pt_br: O 'e-mail' deve possuir no mínimo 8 carateres.

# InvalidLoginCredentials
source: The 'email' or 'password' is invalid.
pt_br: O 'e-mail' ou 'senha' são inválidos.

# MaximumPasswordLength
source: The 'password' must have a maximum of 64 characters.
pt_br: A 'senha' deve possuir no máximo 64 carateres.

# MinimumPasswordLength
source: The 'password' must have a minimum of 8 characters.
pt_br: A 'senha' deve possuir no mínimo 8 carateres.

# PasswordIsRequired
source: The 'password' must be provided.
pt_br: A 'senha' deve ser informada.

# StrongPassword
source: The 'password' must have at least: one capital letter and one number.
pt_br: A 'senha' deve possuir pelo menos: uma letra maiúscula e um número.
